eagletrt/fenice-bms-hv/mainboard/stm32cubemx/f446_64pin/f446_64pin.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32F4
ProjectManager.MainLocation=Core/Src
PC7.GPIOParameters=GPIO_Label
PH0-OSC_IN.Signal=RCC_OSC_IN
RCC.CortexFreq_Value=16000000
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32F446RETx
SPI2.VirtualType=VM_MASTER
PB10.Mode=Asynchronous
PC12.Locked=true
CAN2.CalculateTimeBit=3000.00
SH.ADCx_IN2.0=ADC2_IN2,IN2
PC10.Locked=true
RCC.PLLCLKFreq_Value=96000000
PC10.Signal=GPIO_Output
PC12.Signal=GPIO_Output
RCC.PLLQCLKFreq_Value=96000000
PC5.Locked=true
PC7.Locked=true
PA12.GPIOParameters=GPIO_Label
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-SystemClock_Config-RCC-false-HAL-false,3-MX_ADC1_Init-ADC1-false-HAL-true,4-MX_ADC2_Init-ADC2-false-HAL-true,5-MX_ADC3_Init-ADC3-false-HAL-true,6-MX_CAN1_Init-CAN1-false-HAL-true,7-MX_CAN2_Init-CAN2-false-HAL-true,8-MX_SPI2_Init-SPI2-false-HAL-true,9-MX_USART1_UART_Init-USART1-false-HAL-true,10-MX_USART3_UART_Init-USART3-false-HAL-true,11-MX_TIM2_Init-TIM2-false-HAL-true,12-MX_TIM4_Init-TIM4-false-HAL-true
PA9.GPIOParameters=GPIO_Label
PA11.GPIOParameters=GPIO_Label
PC6.GPIO_Label=CS_EEPROM
PC3.Locked=true
PA11.Mode=CAN_Activate
PC9.Locked=true
PA6.GPIO_Label=MUX_A1
PB0.GPIO_Label=SI8900_RST
PB6.GPIO_Label=CAN_CELL_TX
RCC.PLLI2SRCLKFreq_Value=96000000
PD2.Locked=true
PD2.GPIOParameters=GPIO_Label
PC5.Mode=Asynchronous
USART1.IPParameters=VirtualMode
SH.S_TIM4_CH4.ConfNb=1
PC1.Locked=true
PB13.Signal=SPI2_SCK
PB15.Signal=SPI2_MOSI
ADC3.Channel-0\#ChannelRegularConversion=ADC_CHANNEL_13
RCC.SAIAFreq_Value=96000000
PA2.GPIOParameters=GPIO_Label
PinOutPanel.RotationAngle=-180
ProjectManager.StackSize=0x400
PB5.GPIOParameters=GPIO_Label
Mcu.IP4=CAN2
Mcu.IP5=NVIC
Mcu.IP2=ADC3
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.IP3=CAN1
Mcu.IP0=ADC1
PA12.Locked=true
Mcu.IP1=ADC2
PA12.Signal=CAN1_TX
Mcu.UserConstants=
PC1.GPIOParameters=GPIO_Label
Mcu.ThirdPartyNb=0
RCC.SDIOFreq_Value=96000000
SH.ADCx_IN3.0=ADC2_IN3,IN3
Mcu.IPNb=13
TIM2.IPParameters=Channel-Input_Capture4_from_TI4
ProjectManager.PreviousToolchain=
PB6.Signal=CAN2_TX
ADC1.Channel-2\#ChannelRegularConversion=ADC_CHANNEL_4
PC7.Signal=GPIO_Output
SH.ADCx_IN3.ConfNb=1
PB6.Mode=CAN_Activate
PC3.Signal=ADCx_IN13
Mcu.Pin6=PA1
Mcu.Pin7=PA2
VP_TIM2_VS_ClockSourceINT.Signal=TIM2_VS_ClockSourceINT
Mcu.Pin8=PA3
Mcu.Pin9=PA4
RCC.VCOSAIOutputFreq_Value=192000000
PH0-OSC_IN.Mode=HSE-External-Oscillator
PB13.Locked=true
Mcu.Pin0=PH0-OSC_IN
Mcu.Pin1=PH1-OSC_OUT
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PC1
Mcu.Pin3=PC2
Mcu.Pin4=PC3
PA0-WKUP.GPIOParameters=GPIO_Label
Mcu.Pin5=PA0-WKUP
ProjectManager.ProjectBuild=false
RCC.HSE_VALUE=16000000
TIM4.Channel-PWM\ Generation3\ CH3=TIM_CHANNEL_3
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PB2.Signal=S_TIM2_CH4
PB3.Mode=Trace_Asynchronous_SW
PA4.Locked=true
Mcu.IP10=TIM4
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
Mcu.IP12=USART3
Mcu.IP11=USART1
ProjectManager.FirmwarePackage=STM32Cube FW_F4 V1.26.1
MxDb.Version=DB.6.0.20
PB0.GPIOParameters=GPIO_Label
ADC1.Rank-2\#ChannelRegularConversion=1
PA1.GPIOParameters=GPIO_Label
ProjectManager.BackupPrevious=false
RCC.VCOInputFreq_Value=1000000
PC4.GPIO_Label=MUX_A3
PA14.Mode=Trace_Asynchronous_SW
SH.ADCx_IN1.ConfNb=1
PB14.Mode=Full_Duplex_Master
PC11.GPIO_Label=TS_ON
PB5.Mode=CAN_Activate
File.Version=6
PA10.GPIO_Label=RX_SWD
SPI2.CalculateBaudRate=8.0 MBits/s
ADC3.IPParameters=Rank-0\#ChannelRegularConversion,Channel-0\#ChannelRegularConversion,SamplingTime-0\#ChannelRegularConversion,NbrOfConversionFlag
SH.ADCx_IN13.ConfNb=1
SH.ADCx_IN11.ConfNb=1
PB8.Locked=true
RCC.PLLRCLKFreq_Value=96000000
SH.ADCx_IN0.0=ADC2_IN0,IN0
SH.ADCx_IN4.ConfNb=1
PB6.Locked=true
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PB6.GPIOParameters=GPIO_Label
ProjectManager.HalAssertFull=false
PB0.Locked=true
ProjectManager.ProjectName=f446_64pin
PH1-OSC_OUT.Mode=HSE-External-Oscillator
PC8.GPIOParameters=GPIO_Label
Mcu.Package=LQFP64
PB9.Signal=S_TIM4_CH4
PA6.Signal=GPIO_Output
PA7.Locked=true
PA5.Locked=true
SPI2.Mode=SPI_MODE_MASTER
PA14.Locked=true
ProjectManager.ToolChainLocation=
PA2.GPIO_Label=FB_IMD_FAULT
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
ADC3.Rank-0\#ChannelRegularConversion=1
USART3.IPParameters=VirtualMode
PA10.Signal=USART1_RX
PA5.GPIOParameters=GPIO_Label
SH.ADCx_IN1.0=ADC2_IN1,IN1
ADC2.SamplingTime-2\#ChannelRegularConversion=ADC_SAMPLETIME_3CYCLES
PB5.GPIO_Label=CAN_CELL_RX
RCC.CECFreq_Value=32786.88524590164
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PC4.Locked=true
ADC2.Rank-2\#ChannelRegularConversion=1
SPI2.Direction=SPI_DIRECTION_2LINES
PC5.Signal=USART3_RX
PB13.Mode=Full_Duplex_Master
PB10.GPIOParameters=GPIO_Label
SH.S_TIM2_CH4.ConfNb=1
RCC.SAIBFreq_Value=96000000
TIM4.Channel-PWM\ Generation4\ CH4=TIM_CHANNEL_4
CAN1.CalculateTimeBit=3000.00
PA4.GPIO_Label=MUX_INPUT
PC2.GPIO_Label=IP_LOW
ProjectManager.CustomerFirmwarePackage=
PC4.GPIOParameters=GPIO_Label
RCC.PLLSAIQCLKFreq_Value=96000000
PB15.Locked=true
PB3.Locked=true
PA3.Signal=ADCx_IN3
CAN1.CalculateTimeQuantum=1000.0
PA2.Locked=true
PA6.GPIOParameters=GPIO_Label
RCC.PLLSourceVirtual=RCC_PLLSOURCE_HSE
CAN2.CalculateBaudRate=333333
ProjectManager.ProjectFileName=f446_64pin.ioc
SH.ADCx_IN13.0=ADC3_IN13,IN13
PB8.GPIOParameters=GPIO_Label
PB9.GPIO_Label=LED1
PA10.Mode=Asynchronous
PC10.GPIO_Label=BMS_FAULT
Mcu.PinsNb=43
PC9.GPIO_Label=CARD_OK
ProjectManager.NoMain=false
PC11.Locked=true
ADC1.IPParameters=Rank-2\#ChannelRegularConversion,master,Channel-2\#ChannelRegularConversion,SamplingTime-2\#ChannelRegularConversion,NbrOfConversionFlag
SH.S_TIM4_CH4.0=TIM4_CH4,PWM Generation4 CH4
PC11.Signal=GPIO_Output
PA9.GPIO_Label=TX_SWD
CAN1.IPParameters=CalculateTimeQuantum,CalculateTimeBit,CalculateBaudRate
CAN1.CalculateBaudRate=333333
CAN2.IPParameters=CalculateTimeQuantum,CalculateTimeBit,CalculateBaudRate
RCC.VCOI2SInputFreq_Value=1000000
PC8.Signal=GPIO_Output
PC2.Signal=ADCx_IN12
PC4.Signal=GPIO_Output
PC6.Signal=GPIO_Output
PA11.GPIO_Label=CAN_RX
ProjectManager.DefaultFWLocation=true
ProjectManager.DeletePrevious=true
PB14.Locked=true
PB10.Locked=true
PC11.GPIOParameters=GPIO_Label
PA12.GPIO_Label=CAN_TX
ADC1.SamplingTime-2\#ChannelRegularConversion=ADC_SAMPLETIME_3CYCLES
RCC.FamilyName=M
PA0-WKUP.GPIO_Label=FB_RELAY_LV
PA0-WKUP.Signal=ADCx_IN0
PA0-WKUP.Locked=true
PB9.GPIOParameters=GPIO_Label
PC3.GPIOParameters=GPIO_Label
PC8.GPIO_Label=CS_CARD
PC12.GPIOParameters=GPIO_Label
PA13.Signal=SYS_JTMS-SWDIO
PB8.GPIO_Label=LED2
PA11.Locked=true
PA9.Mode=Asynchronous
SH.ADCx_IN12.0=ADC3_IN12,IN12
ADC3.SamplingTime-0\#ChannelRegularConversion=ADC_SAMPLETIME_3CYCLES
VP_TIM4_VS_ClockSourceINT.Signal=TIM4_VS_ClockSourceINT
ProjectManager.TargetToolchain=EWARM V8.32
TIM4.IPParameters=Channel-PWM Generation4 CH4,Channel-PWM Generation3 CH3
PB10.GPIO_Label=TX_SI8900
SH.S_TIM4_CH3.0=TIM4_CH3,PWM Generation3 CH3
ADC2.IPParameters=Rank-2\#ChannelRegularConversion,Channel-2\#ChannelRegularConversion,SamplingTime-2\#ChannelRegularConversion,NbrOfConversionFlag
PC5.GPIOParameters=GPIO_Label
PC6.Locked=true
PB2.GPIOParameters=GPIO_Label
PA9.Signal=USART1_TX
PB5.Locked=true
PB9.Locked=true
SPI2.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate
PC2.Locked=true
ProjectManager.RegisterCallBack=
RCC.USBFreq_Value=96000000
PA1.Signal=ADCx_IN1
PB10.Signal=USART3_TX
SH.S_TIM4_CH3.ConfNb=1
RCC.VCOI2SOutputFreq_Value=192000000
PB14.Signal=SPI2_MISO
PA5.Signal=GPIO_Output
Mcu.Pin40=VP_SYS_VS_Systick
Mcu.Pin41=VP_TIM2_VS_ClockSourceINT
Mcu.Pin42=VP_TIM4_VS_ClockSourceINT
RCC.PLLSAIPCLKFreq_Value=96000000
board=custom
RCC.VCOOutputFreq_Value=192000000
ProjectManager.LastFirmware=true
PB15.Mode=Full_Duplex_Master
ADC2.Channel-2\#ChannelRegularConversion=ADC_CHANNEL_3
SH.ADCx_IN11.0=ADC3_IN11,IN11
MxCube.Version=6.2.0
Mcu.Pin37=PB6
Mcu.Pin38=PB8
Mcu.Pin35=PB3
VP_TIM2_VS_ClockSourceINT.Mode=Internal
Mcu.Pin36=PB5
RCC.PLLI2SPCLKFreq_Value=96000000
SH.ADCx_IN0.ConfNb=1
Mcu.Pin39=PB9
PC2.GPIOParameters=GPIO_Label
SH.ADCx_IN2.ConfNb=1
Mcu.Pin30=PA14
PA1.GPIO_Label=FB_FROM_TSMS
PC1.GPIO_Label=CHARGE
PA10.GPIOParameters=GPIO_Label
VP_SYS_VS_Systick.Mode=SysTick
CAN2.CalculateTimeQuantum=1000.0
SH.ADCx_IN12.ConfNb=1
Mcu.Pin33=PC12
PH1-OSC_OUT.Signal=RCC_OSC_OUT
Mcu.Pin34=PD2
TIM2.Channel-Input_Capture4_from_TI4=TIM_CHANNEL_4
Mcu.Pin31=PC10
SH.ADCx_IN4.0=ADC1_IN4,IN4
Mcu.Pin32=PC11
PA9.Locked=true
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA4.GPIOParameters=GPIO_Label
PC10.GPIOParameters=GPIO_Label
PA13.Mode=Trace_Asynchronous_SW
ProjectManager.FreePins=false
RCC.IPParameters=CECFreq_Value,CortexFreq_Value,FamilyName,HSE_VALUE,PLLCLKFreq_Value,PLLI2SPCLKFreq_Value,PLLI2SQCLKFreq_Value,PLLI2SRCLKFreq_Value,PLLQCLKFreq_Value,PLLRCLKFreq_Value,PLLSAIPCLKFreq_Value,PLLSAIQCLKFreq_Value,PLLSourceVirtual,SAIAFreq_Value,SAIBFreq_Value,SDIOFreq_Value,USBFreq_Value,VCOI2SInputFreq_Value,VCOI2SOutputFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value,VCOSAIInputFreq_Value,VCOSAIOutputFreq_Value
PC9.GPIOParameters=GPIO_Label
ProjectManager.AskForMigrate=true
Mcu.Name=STM32F446R(C-E)Tx
RCC.PLLI2SQCLKFreq_Value=96000000
Mcu.Pin26=PA10
Mcu.Pin27=PA11
PA2.Signal=ADCx_IN2
Mcu.Pin24=PC9
ProjectManager.UnderRoot=false
Mcu.Pin25=PA9
PB2.Locked=true
Mcu.IP8=SYS
Mcu.IP9=TIM2
PC7.GPIO_Label=HOLD
Mcu.Pin28=PA12
Mcu.IP6=RCC
Mcu.Pin29=PA13
RCC.VCOSAIInputFreq_Value=1000000
Mcu.IP7=SPI2
ProjectManager.CoupleFile=false
PB3.Signal=SYS_JTDO-SWO
PA4.Signal=ADCx_IN4
Mcu.Pin22=PC7
PB5.Signal=CAN2_RX
Mcu.Pin23=PC8
PA1.Locked=true
PA7.GPIO_Label=MUX_A2
Mcu.Pin20=PB15
ADC1.master=1
PA3.Locked=true
Mcu.Pin21=PC6
PA12.Mode=CAN_Activate
PA5.GPIO_Label=MUX_A0
PA10.Locked=true
ADC2.NbrOfConversionFlag=1
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
PC5.GPIO_Label=RX_SI8900
USART3.VirtualMode=VM_ASYNC
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA13.Locked=true
PC12.GPIO_Label=AIRP_OFF
USART1.VirtualMode=VM_ASYNC
ProjectManager.CompilerOptimize=6
PA11.Signal=CAN1_RX
PA14.Signal=SYS_JTCK-SWCLK
PB2.GPIO_Label=IMD_PWM
ProjectManager.HeapSize=0x200
Mcu.Pin15=PB0
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.Pin16=PB2
Mcu.Pin13=PC4
SH.S_TIM2_CH4.0=TIM2_CH4,Input_Capture4_from_TI4
Mcu.Pin14=PC5
PC6.GPIOParameters=GPIO_Label
Mcu.Pin19=PB14
ProjectManager.ComputerToolchain=false
Mcu.Pin17=PB10
Mcu.Pin18=PB13
VP_TIM4_VS_ClockSourceINT.Mode=Internal
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
ADC1.NbrOfConversionFlag=1
Mcu.Pin11=PA6
Mcu.Pin12=PA7
Mcu.Pin10=PA5
PB8.Signal=S_TIM4_CH3
PC3.GPIO_Label=IP_HIGH
PC8.Locked=true
PC9.Signal=GPIO_Input
PD2.Signal=GPIO_Output
ADC3.NbrOfConversionFlag=1
PB0.Signal=GPIO_Output
PA7.GPIOParameters=GPIO_Label
ProjectManager.DeviceId=STM32F446RETx
PC1.Signal=ADCx_IN11
PD2.GPIO_Label=AIRN_OFF
ProjectManager.LibraryCopy=0
PA7.Signal=GPIO_Output
PA6.Locked=true
